# Pandas
- **Pandas** is a fast, powerful and easy to use open source data analysis and manipulation library.
1. Series
2. DataFrame

In [1]:
import numpy as np
import pandas as pd

# 1. Series

In [2]:
data = [1,2,3,4,5]
s1 = pd.Series(data)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
s1[3]

4

In [3]:
type(s1)

pandas.core.series.Series

In [4]:
s1.values

array([1, 2, 3, 4, 5], dtype=int64)

In [5]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
list(s1.index)

[0, 1, 2, 3, 4]

In [8]:
s1.index = [101,102,103,104,105]
s1

101    1
102    2
103    3
104    4
105    5
dtype: int64

In [9]:
s1.index = ['A', 'B', 'C', 'D', 'E']
s1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [10]:
s1.index = range(1001,1006)
s1

1001    1
1002    2
1003    3
1004    4
1005    5
dtype: int64

In [11]:
s1.index = [1.5,2.5,3.5,4.5,5.7]
s1

1.5    1
2.5    2
3.5    3
4.5    4
5.7    5
dtype: int64

In [12]:
s1.index = ['A', 'B', 'C', 'D', 'E']
s1

A    1
B    2
C    3
D    4
E    5
dtype: int64

## Accessing data in Series

In [25]:
s1[0]

1

In [26]:
s1[1]

2

In [27]:
s1[-1]

5

In [28]:
s1['A']

1

In [29]:
s1['B']

2

In [30]:
s1['D']

4

In [31]:
s1.iloc[0]                       # By positional indexing

1

In [16]:
s1.loc['A']

1

In [21]:
s1.loc['A']                      # By index that has been provided

1

## Add, update and Delete operations

In [33]:
s1['F'] = 6
s1

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [34]:
s1['D'] = 40
s1

A     1
B     2
C     3
D    40
E     5
F     6
dtype: int64

In [37]:
s1.drop('D', inplace = True)

In [38]:
s1

A    1
B    2
C    3
E    5
F    6
dtype: int64

## Slicing

In [39]:
s1[:]

A    1
B    2
C    3
E    5
F    6
dtype: int64

In [40]:
s1[2:5]

C    3
E    5
F    6
dtype: int64

In [41]:
s1[-1::-1]

F    6
E    5
C    3
B    2
A    1
dtype: int64

In [42]:
s1[::2]

A    1
C    3
F    6
dtype: int64

## Creating Series from Dictionary

In [18]:
data = {'Jaipur' : 'Rajasthan',
        'Mumbai' : 'Maharashtra',
        'Kolkata': 'West Bengal',
        'Chandigarh' : 'Punjab',
        'Bengaluru' : 'Karnataka'}
data

{'Jaipur': 'Rajasthan',
 'Mumbai': 'Maharashtra',
 'Kolkata': 'West Bengal',
 'Chandigarh': 'Punjab',
 'Bengaluru': 'Karnataka'}

In [19]:
s2 = pd.Series(data)
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
dtype: object

In [20]:
s2['Jaipur']

'Rajasthan'

In [21]:
s2.index

Index(['Jaipur', 'Mumbai', 'Kolkata', 'Chandigarh', 'Bengaluru'], dtype='object')

In [22]:
s2.values

array(['Rajasthan', 'Maharashtra', 'West Bengal', 'Punjab', 'Karnataka'],
      dtype=object)

In [23]:
s2[0]

'Rajasthan'

In [24]:
s2.loc['Jaipur']

'Rajasthan'

In [25]:
s2.iloc[0]

'Rajasthan'

In [35]:
s2.name = 'States and Capitals'
s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
Name: States and Capitals, dtype: object

In [36]:
s2.name

'States and Capitals'

In [37]:
s2.index.name = 'Capitals'

s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
Name: States and Capitals, dtype: object

In [38]:
print(s2.index)
print(s2.values)
print(s2.dtype)
print(s2.name)
print(s2.index.name)

Index(['Jaipur', 'Mumbai', 'Kolkata', 'Chandigarh', 'Bengaluru'], dtype='object', name='Capitals')
['Rajasthan' 'Maharashtra' 'West Bengal' 'Punjab' 'Karnataka']
object
States and Capitals
Capitals

In [39]:
s2[['Jaipur','Mumbai','Kolkata']]

Capitals
Jaipur       Rajasthan
Mumbai     Maharashtra
Kolkata    West Bengal
Name: States and Capitals, dtype: object

In [40]:
roll_no = [101,102,103,104,105]
result = [68,89,93,74,96]

s3 = pd.Series(data = result, index = roll_no)
s3.name = 'Final Result'
s3.index.name = 'Roll No'
s3

Roll No
101    68
102    89
103    93
104    74
105    96
Name: Final Result, dtype: int64

In [41]:
s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Chandigarh         Punjab
Bengaluru       Karnataka
Name: States and Capitals, dtype: object

In [42]:
capitals = ['Jaipur', 'Kolkata', 'Mumbai']
s4 = pd.Series(data = s2, index = capitals)
s4

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Name: States and Capitals, dtype: object

In [43]:
capitals = ['Jaipur', 'Kolkata', 'Mumbai', 'Delhi','Chennai']
s5 = pd.Series(data = s2, index = capitals)
s5

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Chennai            NaN
Name: States and Capitals, dtype: object

## Functions

In [44]:
s5.isnull()

Jaipur     False
Kolkata    False
Mumbai     False
Delhi       True
Chennai     True
Name: States and Capitals, dtype: bool

In [45]:
s5.notnull()

Jaipur      True
Kolkata     True
Mumbai      True
Delhi      False
Chennai    False
Name: States and Capitals, dtype: bool

In [46]:
s5.isnull().sum()

2

In [47]:
s5['Bengaluru'] = 'Karnataka'

In [48]:
s5.head()

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Chennai            NaN
Name: States and Capitals, dtype: object

In [49]:
s5.head(3)

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Name: States and Capitals, dtype: object

In [50]:
s5.tail()

Kolkata      West Bengal
Mumbai       Maharashtra
Delhi                NaN
Chennai              NaN
Bengaluru      Karnataka
Name: States and Capitals, dtype: object

In [51]:
s5.tail(3)

Delhi              NaN
Chennai            NaN
Bengaluru    Karnataka
Name: States and Capitals, dtype: object

In [52]:
s5.duplicated()

Jaipur       False
Kolkata      False
Mumbai       False
Delhi        False
Chennai       True
Bengaluru    False
Name: States and Capitals, dtype: bool

In [53]:
s5.duplicated().sum()

1

# --------------------------------------------------------------------------------------
# DataFrames

In [79]:
employee1 = pd.Series({'Name' : 'Utkarsh', 'ID' : 1, 'Gender' : 'Male', 'Salary':95000})
employee2 = pd.Series({'Name' : 'Kartik', 'ID' : 2, 'Gender' : 'Male','Salary':85000})
employee3 = pd.Series({'Name' : 'Aishwarya', 'ID' : 3, 'Gender' : 'Female','Salary':75000})
employee4 = pd.Series({'Name' : 'Anand', 'ID' : 4, 'Gender' : 'Male','Salary':65000})
employee5 = pd.Series({'Name' : 'Shalini', 'ID' : 5, 'Gender' : 'Female','Salary':90000})
employee6 = pd.Series({'Name' : 'Pratik', 'ID' : 6, 'Gender' : 'Male','Salary':80000})
employee7 = pd.Series({'Name' : 'Monalika', 'ID' : 7, 'Gender' : 'Female','Salary':70000})
employee8 = pd.Series({'Name' : 'Ayesha', 'ID' : 8, 'Gender' : 'Female','Salary':60000})
employee9 = pd.Series({'Name' : 'Anant', 'ID' : 9, 'Gender' : 'Male','Salary':100000})
employee10 = pd.Series({'Name' : 'Shamiksha', 'ID' : 10, 'Gender' : 'Female','Salary':45000})
employee11 = pd.Series({'Name' : 'Prashant', 'ID' : 11, 'Gender' : 'Male','Salary':55000})
employee12 = pd.Series({'Name' : 'Mohini', 'ID' : 12, 'Gender' : 'Female','Salary':65000})

In [80]:
employees = [employee1,employee2,employee3,employee4,employee5,employee6,employee7,employee8,employee9,employee10,employee11,employee12]
df1 = pd.DataFrame(data = employees, index = range(101,113))
df1

          Name  ID  Gender  Salary
101    Utkarsh   1    Male   95000
102     Kartik   2    Male   85000
103  Aishwarya   3  Female   75000
104      Anand   4    Male   65000
105    Shalini   5  Female   90000
106     Pratik   6    Male   80000
107   Monalika   7  Female   70000
108     Ayesha   8  Female   60000
109      Anant   9    Male  100000
110  Shamiksha  10  Female   45000
111   Prashant  11    Male   55000
112     Mohini  12  Female   65000

In [81]:
df1.head()

          Name  ID  Gender  Salary
101    Utkarsh   1    Male   95000
102     Kartik   2    Male   85000
103  Aishwarya   3  Female   75000
104      Anand   4    Male   65000
105    Shalini   5  Female   90000

In [83]:
df1.tail()

          Name  ID  Gender  Salary
108     Ayesha   8  Female   60000
109      Anant   9    Male  100000
110  Shamiksha  10  Female   45000
111   Prashant  11    Male   55000
112     Mohini  12  Female   65000

In [84]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 101 to 112
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    12 non-null     object
 1   ID      12 non-null     int64
 2   Gender  12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [85]:
df1.index

RangeIndex(start=101, stop=113, step=1)

In [86]:
df1.values

array([['Utkarsh', 1, 'Male', 95000],
       ['Kartik', 2, 'Male', 85000],
       ['Aishwarya', 3, 'Female', 75000],
       ['Anand', 4, 'Male', 65000],
       ['Shalini', 5, 'Female', 90000],
       ['Pratik', 6, 'Male', 80000],
       ['Monalika', 7, 'Female', 70000],
       ['Ayesha', 8, 'Female', 60000],
       ['Anant', 9, 'Male', 100000],
       ['Shamiksha', 10, 'Female', 45000],
       ['Prashant', 11, 'Male', 55000],
       ['Mohini', 12, 'Female', 65000]], dtype=object)

In [87]:
df1.columns

Index(['Name', 'ID', 'Gender', 'Salary'], dtype='object')

In [90]:
df1.name = 'Employee_Details'
df1.index.name = 'Employee_ID'

In [92]:
df1.name

'Employee_Details'

In [93]:
df1.index.name

'Employee_ID'

## Accessing data from DataFrame

In [94]:
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107           Monalika   7  Female   70000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000

#### Accessing Columns

In [98]:
df1['Name']

Employee_ID
101      Utkarsh
102       Kartik
103    Aishwarya
104        Anand
105      Shalini
106       Pratik
107     Monalika
108       Ayesha
109        Anant
110    Shamiksha
111     Prashant
112       Mohini
Name: Name, dtype: object

In [99]:
df1['Salary']

Employee_ID
101     95000
102     85000
103     75000
104     65000
105     90000
106     80000
107     70000
108     60000
109    100000
110     45000
111     55000
112     65000
Name: Salary, dtype: int64

In [101]:
df1[['Name', 'Salary']]

                  Name  Salary
Employee_ID
101            Utkarsh   95000
102             Kartik   85000
103          Aishwarya   75000
104              Anand   65000
105            Shalini   90000
106             Pratik   80000
107           Monalika   70000
108             Ayesha   60000
109              Anant  100000
110          Shamiksha   45000
111           Prashant   55000
112             Mohini   65000

In [102]:
df1.Name

Employee_ID
101      Utkarsh
102       Kartik
103    Aishwarya
104        Anand
105      Shalini
106       Pratik
107     Monalika
108       Ayesha
109        Anant
110    Shamiksha
111     Prashant
112       Mohini
Name: Name, dtype: object

In [103]:
df1.Salary

Employee_ID
101     95000
102     85000
103     75000
104     65000
105     90000
106     80000
107     70000
108     60000
109    100000
110     45000
111     55000
112     65000
Name: Salary, dtype: int64

#### Accessing Records (Rows)

In [104]:
df1.loc[101]

Name      Utkarsh
ID              1
Gender       Male
Salary      95000
Name: 101, dtype: object

In [105]:
df1.iloc[0]

Name      Utkarsh
ID              1
Gender       Male
Salary      95000
Name: 101, dtype: object

In [106]:
df1.loc[105]

Name      Shalini
ID              5
Gender     Female
Salary      90000
Name: 105, dtype: object

In [107]:
df1.loc[[101,105,109]]

                Name  ID  Gender  Salary
Employee_ID
101          Utkarsh   1    Male   95000
105          Shalini   5  Female   90000
109            Anant   9    Male  100000

In [108]:
df1.iloc[[0,4,6,9]]

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
105            Shalini   5  Female   90000
107           Monalika   7  Female   70000
110          Shamiksha  10  Female   45000

### Accessing Specific Values

In [109]:
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107           Monalika   7  Female   70000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000

In [111]:
df1.loc[105]['Salary']

90000

In [112]:
df1.loc[103]['Name']

'Aishwarya'

In [113]:
df1.iloc[4]['Salary']

90000

In [114]:
df1.iloc[2]['Name']

'Aishwarya'

In [116]:
df1['Salary'][105]

90000

In [117]:
df1['Name'][103]

'Aishwarya'

In [120]:
df1.Salary[105]

90000

In [121]:
df1.Name[103]

'Aishwarya'

In [123]:
df1.loc[[101,105,108]]['Salary']

Employee_ID
101    95000
105    90000
108    60000
Name: Salary, dtype: int64

In [124]:
df1.loc[[101,105,108,110]][['Name', 'Salary']]

                  Name  Salary
Employee_ID
101            Utkarsh   95000
105            Shalini   90000
108             Ayesha   60000
110          Shamiksha   45000

In [126]:
df1.iloc[[0,4,7,9]][['Name', 'Salary']]

                  Name  Salary
Employee_ID
101            Utkarsh   95000
105            Shalini   90000
108             Ayesha   60000
110          Shamiksha   45000

In [127]:
df1.loc[105, 'Salary']

90000

In [128]:
df1.loc[[105,108,110], 'Salary']

Employee_ID
105    90000
108    60000
110    45000
Name: Salary, dtype: int64

In [129]:
df1.loc[[105,108,110], ['Name','Salary']]

                  Name  Salary
Employee_ID
105            Shalini   90000
108             Ayesha   60000
110          Shamiksha   45000

In [131]:
df1.loc[101:106]

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000

In [132]:
df1.loc[101:106, ['Name','Salary']]

                  Name  Salary
Employee_ID
101            Utkarsh   95000
102             Kartik   85000
103          Aishwarya   75000
104              Anand   65000
105            Shalini   90000
106             Pratik   80000

## Adding and Deleting Rows and Columns

In [135]:
df1.loc[113] = ['Priti', 13, 'Female', 71000]
df1

                  Name  ID  Gender  Salary
Employee_ID
101            Utkarsh   1    Male   95000
102             Kartik   2    Male   85000
103          Aishwarya   3  Female   75000
104              Anand   4    Male   65000
105            Shalini   5  Female   90000
106             Pratik   6    Male   80000
107           Monalika   7  Female   70000
108             Ayesha   8  Female   60000
109              Anant   9    Male  100000
110          Shamiksha  10  Female   45000
111           Prashant  11    Male   55000
112             Mohini  12  Female   65000
113              Priti  13  Female   71000

In [137]:
df1['Age'] = np.random.randint(25,50,13)
df1

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   49
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
104              Anand   4    Male   65000   29
105            Shalini   5  Female   90000   47
106             Pratik   6    Male   80000   49
107           Monalika   7  Female   70000   30
108             Ayesha   8  Female   60000   26
109              Anant   9    Male  100000   38
110          Shamiksha  10  Female   45000   25
111           Prashant  11    Male   55000   38
112             Mohini  12  Female   65000   25
113              Priti  13  Female   71000   43

In [138]:
df1.drop(113, inplace = True, axis = 0)
df1

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   49
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
104              Anand   4    Male   65000   29
105            Shalini   5  Female   90000   47
106             Pratik   6    Male   80000   49
107           Monalika   7  Female   70000   30
108             Ayesha   8  Female   60000   26
109              Anant   9    Male  100000   38
110          Shamiksha  10  Female   45000   25
111           Prashant  11    Male   55000   38
112             Mohini  12  Female   65000   25

In [139]:
df1['City'] = 'Jaipur'
df1

                  Name  ID  Gender  Salary  Age    City
Employee_ID
101            Utkarsh   1    Male   95000   49  Jaipur
102             Kartik   2    Male   85000   44  Jaipur
103          Aishwarya   3  Female   75000   49  Jaipur
104              Anand   4    Male   65000   29  Jaipur
105            Shalini   5  Female   90000   47  Jaipur
106             Pratik   6    Male   80000   49  Jaipur
107           Monalika   7  Female   70000   30  Jaipur
108             Ayesha   8  Female   60000   26  Jaipur
109              Anant   9    Male  100000   38  Jaipur
110          Shamiksha  10  Female   45000   25  Jaipur
111           Prashant  11    Male   55000   38  Jaipur
112             Mohini  12  Female   65000   25  Jaipur

In [141]:
df1.drop('City', inplace = True, axis = 1)

In [142]:
df1

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   49
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
104              Anand   4    Male   65000   29
105            Shalini   5  Female   90000   47
106             Pratik   6    Male   80000   49
107           Monalika   7  Female   70000   30
108             Ayesha   8  Female   60000   26
109              Anant   9    Male  100000   38
110          Shamiksha  10  Female   45000   25
111           Prashant  11    Male   55000   38
112             Mohini  12  Female   65000   25

## Querying Based on Condition

In [143]:
df1[df1.Age > 40]

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   49
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
105            Shalini   5  Female   90000   47
106             Pratik   6    Male   80000   49

In [144]:
df1[df1.Salary < 70000]

                  Name  ID  Gender  Salary  Age
Employee_ID
104              Anand   4    Male   65000   29
108             Ayesha   8  Female   60000   26
110          Shamiksha  10  Female   45000   25
111           Prashant  11    Male   55000   38
112             Mohini  12  Female   65000   25

In [145]:
df1[df1.Salary < 70000][['Name', 'Age']]

                  Name  Age
Employee_ID
104              Anand   29
108             Ayesha   26
110          Shamiksha   25
111           Prashant   38
112             Mohini   25

In [147]:
df1[df1.Gender == 'Male']

                 Name  ID Gender  Salary  Age
Employee_ID
101           Utkarsh   1   Male   95000   49
102            Kartik   2   Male   85000   44
104             Anand   4   Male   65000   29
106            Pratik   6   Male   80000   49
109             Anant   9   Male  100000   38
111          Prashant  11   Male   55000   38

In [148]:
df1[df1.Gender == 'Male'][df1.Salary > 80000]

<ipython-input-148-2e397ca7b8c5>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df1[df1.Gender == 'Male'][df1.Salary > 80000]

                Name  ID Gender  Salary  Age
Employee_ID
101          Utkarsh   1   Male   95000   49
102           Kartik   2   Male   85000   44
109            Anant   9   Male  100000   38

In [149]:
df1[df1.Gender == 'Female'][df1.Salary > 80000]

<ipython-input-149-70260dee9cb2>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df1[df1.Gender == 'Female'][df1.Salary > 80000]

                Name  ID  Gender  Salary  Age
Employee_ID
105          Shalini   5  Female   90000   47

In [150]:
df1[df1.Gender == 'Female'][df1.Age > 45]

<ipython-input-150-642a35c07123>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df1[df1.Gender == 'Female'][df1.Age > 45]

                  Name  ID  Gender  Salary  Age
Employee_ID
103          Aishwarya   3  Female   75000   49
105            Shalini   5  Female   90000   47

In [151]:
df1.query('Salary > 70000')

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   49
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
105            Shalini   5  Female   90000   47
106             Pratik   6    Male   80000   49
109              Anant   9    Male  100000   38

In [153]:
df1.query('Gender == "Male"')

                 Name  ID Gender  Salary  Age
Employee_ID
101           Utkarsh   1   Male   95000   49
102            Kartik   2   Male   85000   44
104             Anand   4   Male   65000   29
106            Pratik   6   Male   80000   49
109             Anant   9   Male  100000   38
111          Prashant  11   Male   55000   38

In [154]:
df1.query('Salary > 70000 and Age > 40')

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   49
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
105            Shalini   5  Female   90000   47
106             Pratik   6    Male   80000   49

In [156]:
df1.query('Salary > 70000 and Salary < 90000')

                  Name  ID  Gender  Salary  Age
Employee_ID
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
106             Pratik   6    Male   80000   49

# Important Functions

In [157]:
df1

                  Name  ID  Gender  Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000   49
102             Kartik   2    Male   85000   44
103          Aishwarya   3  Female   75000   49
104              Anand   4    Male   65000   29
105            Shalini   5  Female   90000   47
106             Pratik   6    Male   80000   49
107           Monalika   7  Female   70000   30
108             Ayesha   8  Female   60000   26
109              Anant   9    Male  100000   38
110          Shamiksha  10  Female   45000   25
111           Prashant  11    Male   55000   38
112             Mohini  12  Female   65000   25

In [161]:
df1.loc[113] = df1.loc[109]
df1.loc[114] = df1.loc[110]
df1.loc[115] = ['Kavita', 15, np.nan, np.nan, 30]
df1.loc[116] = ['Pratik', 16, np.nan, np.nan, 32]
df1

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   49
102             Kartik   2    Male   85000.0   44
103          Aishwarya   3  Female   75000.0   49
104              Anand   4    Male   65000.0   29
105            Shalini   5  Female   90000.0   47
106             Pratik   6    Male   80000.0   49
107           Monalika   7  Female   70000.0   30
108             Ayesha   8  Female   60000.0   26
109              Anant   9    Male  100000.0   38
110          Shamiksha  10  Female   45000.0   25
111           Prashant  11    Male   55000.0   38
112             Mohini  12  Female   65000.0   25
113              Anant   9    Male  100000.0   38
114          Shamiksha  10  Female   45000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [162]:
df1.head()

                  Name  ID  Gender   Salary  Age
Employee_ID
101            Utkarsh   1    Male  95000.0   49
102             Kartik   2    Male  85000.0   44
103          Aishwarya   3  Female  75000.0   49
104              Anand   4    Male  65000.0   29
105            Shalini   5  Female  90000.0   47

In [163]:
df1.head(10)

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   49
102             Kartik   2    Male   85000.0   44
103          Aishwarya   3  Female   75000.0   49
104              Anand   4    Male   65000.0   29
105            Shalini   5  Female   90000.0   47
106             Pratik   6    Male   80000.0   49
107           Monalika   7  Female   70000.0   30
108             Ayesha   8  Female   60000.0   26
109              Anant   9    Male  100000.0   38
110          Shamiksha  10  Female   45000.0   25

In [165]:
df1.tail()

                  Name  ID  Gender    Salary  Age
Employee_ID
112             Mohini  12  Female   65000.0   25
113              Anant   9    Male  100000.0   38
114          Shamiksha  10  Female   45000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [166]:
df1.tail(6)

                  Name  ID  Gender    Salary  Age
Employee_ID
111           Prashant  11    Male   55000.0   38
112             Mohini  12  Female   65000.0   25
113              Anant   9    Male  100000.0   38
114          Shamiksha  10  Female   45000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [167]:
# Check for null values
df1.isnull().sum()

Name      0
ID        0
Gender    2
Salary    2
Age       0
dtype: int64

In [168]:
# Check for duplicate values
df1.duplicated().sum()

2

In [169]:
# To drop duplicate records
df1.drop_duplicates(inplace = True)
df1

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   49
102             Kartik   2    Male   85000.0   44
103          Aishwarya   3  Female   75000.0   49
104              Anand   4    Male   65000.0   29
105            Shalini   5  Female   90000.0   47
106             Pratik   6    Male   80000.0   49
107           Monalika   7  Female   70000.0   30
108             Ayesha   8  Female   60000.0   26
109              Anant   9    Male  100000.0   38
110          Shamiksha  10  Female   45000.0   25
111           Prashant  11    Male   55000.0   38
112             Mohini  12  Female   65000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [170]:
df1.nunique()

Name      13
ID        14
Gender     2
Salary    11
Age        9
dtype: int64

In [171]:
df1['Name'].unique()

array(['Utkarsh', 'Kartik', 'Aishwarya', 'Anand', 'Shalini', 'Pratik',
       'Monalika', 'Ayesha', 'Anant', 'Shamiksha', 'Prashant', 'Mohini',
       'Kavita'], dtype=object)

In [172]:
df1['Gender'].unique()

array(['Male', 'Female', nan], dtype=object)

In [173]:
df1.sort_index()

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   49
102             Kartik   2    Male   85000.0   44
103          Aishwarya   3  Female   75000.0   49
104              Anand   4    Male   65000.0   29
105            Shalini   5  Female   90000.0   47
106             Pratik   6    Male   80000.0   49
107           Monalika   7  Female   70000.0   30
108             Ayesha   8  Female   60000.0   26
109              Anant   9    Male  100000.0   38
110          Shamiksha  10  Female   45000.0   25
111           Prashant  11    Male   55000.0   38
112             Mohini  12  Female   65000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [175]:
df1.sort_index(ascending = False)

                  Name  ID  Gender    Salary  Age
Employee_ID
116             Pratik  16     NaN       NaN   32
115             Kavita  15     NaN       NaN   30
112             Mohini  12  Female   65000.0   25
111           Prashant  11    Male   55000.0   38
110          Shamiksha  10  Female   45000.0   25
109              Anant   9    Male  100000.0   38
108             Ayesha   8  Female   60000.0   26
107           Monalika   7  Female   70000.0   30
106             Pratik   6    Male   80000.0   49
105            Shalini   5  Female   90000.0   47
104              Anand   4    Male   65000.0   29
103          Aishwarya   3  Female   75000.0   49
102             Kartik   2    Male   85000.0   44
101            Utkarsh   1    Male   95000.0   49

In [176]:
df1.sort_values(by = 'Salary')

                  Name  ID  Gender    Salary  Age
Employee_ID
110          Shamiksha  10  Female   45000.0   25
111           Prashant  11    Male   55000.0   38
108             Ayesha   8  Female   60000.0   26
104              Anand   4    Male   65000.0   29
112             Mohini  12  Female   65000.0   25
107           Monalika   7  Female   70000.0   30
103          Aishwarya   3  Female   75000.0   49
106             Pratik   6    Male   80000.0   49
102             Kartik   2    Male   85000.0   44
105            Shalini   5  Female   90000.0   47
101            Utkarsh   1    Male   95000.0   49
109              Anant   9    Male  100000.0   38
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [177]:
df1.sort_values(by = 'Salary', ascending = False)

                  Name  ID  Gender    Salary  Age
Employee_ID
109              Anant   9    Male  100000.0   38
101            Utkarsh   1    Male   95000.0   49
105            Shalini   5  Female   90000.0   47
102             Kartik   2    Male   85000.0   44
106             Pratik   6    Male   80000.0   49
103          Aishwarya   3  Female   75000.0   49
107           Monalika   7  Female   70000.0   30
104              Anand   4    Male   65000.0   29
112             Mohini  12  Female   65000.0   25
108             Ayesha   8  Female   60000.0   26
111           Prashant  11    Male   55000.0   38
110          Shamiksha  10  Female   45000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [178]:
df1.sort_values(by = 'Name')

                  Name  ID  Gender    Salary  Age
Employee_ID
103          Aishwarya   3  Female   75000.0   49
104              Anand   4    Male   65000.0   29
109              Anant   9    Male  100000.0   38
108             Ayesha   8  Female   60000.0   26
102             Kartik   2    Male   85000.0   44
115             Kavita  15     NaN       NaN   30
112             Mohini  12  Female   65000.0   25
107           Monalika   7  Female   70000.0   30
111           Prashant  11    Male   55000.0   38
106             Pratik   6    Male   80000.0   49
116             Pratik  16     NaN       NaN   32
105            Shalini   5  Female   90000.0   47
110          Shamiksha  10  Female   45000.0   25
101            Utkarsh   1    Male   95000.0   49

In [180]:
df1.sort_values(by = ['Age','Salary'])

                  Name  ID  Gender    Salary  Age
Employee_ID
110          Shamiksha  10  Female   45000.0   25
112             Mohini  12  Female   65000.0   25
108             Ayesha   8  Female   60000.0   26
104              Anand   4    Male   65000.0   29
107           Monalika   7  Female   70000.0   30
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32
111           Prashant  11    Male   55000.0   38
109              Anant   9    Male  100000.0   38
102             Kartik   2    Male   85000.0   44
105            Shalini   5  Female   90000.0   47
103          Aishwarya   3  Female   75000.0   49
106             Pratik   6    Male   80000.0   49
101            Utkarsh   1    Male   95000.0   49

In [181]:
pd.concat([df1,df1],axis = 0)

                  Name  ID  Gender    Salary  Age
Employee_ID
101            Utkarsh   1    Male   95000.0   49
102             Kartik   2    Male   85000.0   44
103          Aishwarya   3  Female   75000.0   49
104              Anand   4    Male   65000.0   29
105            Shalini   5  Female   90000.0   47
106             Pratik   6    Male   80000.0   49
107           Monalika   7  Female   70000.0   30
108             Ayesha   8  Female   60000.0   26
109              Anant   9    Male  100000.0   38
110          Shamiksha  10  Female   45000.0   25
111           Prashant  11    Male   55000.0   38
112             Mohini  12  Female   65000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32
101            Utkarsh   1    Male   95000.0   49
102             Kartik   2    Male   85000.0   44
103          Aishwarya   3  Female   75000.0   49
104              Anand   4    Male   65000.0   29
105            Shalini   5  Female   90000.0   47
106             Pratik   6    Male   80000.0   49
107           Monalika   7  Female   70000.0   30
108             Ayesha   8  Female   60000.0   26
109              Anant   9    Male  100000.0   38
110          Shamiksha  10  Female   45000.0   25
111           Prashant  11    Male   55000.0   38
112             Mohini  12  Female   65000.0   25
115             Kavita  15     NaN       NaN   30
116             Pratik  16     NaN       NaN   32

In [182]:
pd.concat([df1,df1], axis = 1)

,Name,ID,Gender,Salary,Age,Name,ID,Gender,Salary,Age
Employee_ID,,,,,,,,,,
101,Utkarsh,1,Male,95000.0,49,Utkarsh,1,Male,95000.0,49
102,Kartik,2,Male,85000.0,44,Kartik,2,Male,85000.0,44
103,Aishwarya,3,Female,75000.0,49,Aishwarya,3,Female,75000.0,49
104,Anand,4,Male,65000.0,29,Anand,4,Male,65000.0,29
105,Shalini,5,Female,90000.0,47,Shalini,5,Female,90000.0,47
106,Pratik,6,Male,80000.0,49,Pratik,6,Male,80000.0,49
107,Monalika,7,Female,70000.0,30,Monalika,7,Female,70000.0,30
108,Ayesha,8,Female,60000.0,26,Ayesha,8,Female,60000.0,26
109,Anant,9,Male,100000.0,38,Anant,9,Male,100000.0,38
110,Shamiksha,10,Female,45000.0,25,Shamiksha,10,Female,45000.0,25
111,Prashant,11,Male,55000.0,38,Prashant,11,Male,55000.0,38
112,Mohini,12,Female,65000.0,25,Mohini,12,Female,65000.0,25
115,Kavita,15,NaN,NaN,30,Kavita,15,NaN,NaN,30
116,Pratik,16,NaN,NaN,32,Pratik,16,NaN,NaN,32

In [183]:
df1.value_counts()

Name       ID  Gender  Salary    Age
Aishwarya  3   Female  75000.0   49     1
Anand      4   Male    65000.0   29     1
Anant      9   Male    100000.0  38     1
Ayesha     8   Female  60000.0   26     1
Kartik     2   Male    85000.0   44     1
Mohini     12  Female  65000.0   25     1
Monalika   7   Female  70000.0   30     1
Prashant   11  Male    55000.0   38     1
Pratik     6   Male    80000.0   49     1
Shalini    5   Female  90000.0   47     1
Shamiksha  10  Female  45000.0   25     1
Utkarsh    1   Male    95000.0   49     1
dtype: int64

In [184]:
df1.Salary.value_counts()

65000.0     2
45000.0     1
55000.0     1
90000.0     1
100000.0    1
95000.0     1
80000.0     1
60000.0     1
85000.0     1
70000.0     1
75000.0     1
Name: Salary, dtype: int64

In [185]:
df1.Gender.value_counts()

Male      6
Female    6
Name: Gender, dtype: int64

In [186]:
df1.describe()

              ID         Salary        Age
count  14.000000      12.000000  14.000000
mean    7.785714   73750.000000  36.500000
std     4.660448   16804.355496   9.509105
min     1.000000   45000.000000  25.000000
25%     4.250000   63750.000000  29.250000
50%     7.500000   72500.000000  35.000000
75%    10.750000   86250.000000  46.250000
max    16.000000  100000.000000  49.000000

In [187]:
df1.count()

Name      14
ID        14
Gender    12
Salary    12
Age       14
dtype: int64

In [188]:
df1.mean()

ID            7.785714
Salary    73750.000000
Age          36.500000
dtype: float64

In [189]:
df1.var()

ID        2.171978e+01
Salary    2.823864e+08
Age       9.042308e+01
dtype: float64

In [190]:
df1.Salary.mean()

73750.0

In [191]:
df1.std()

ID            4.660448
Salary    16804.355496
Age           9.509105
dtype: float64

In [192]:
df1.median()

ID            7.5
Salary    72500.0
Age          35.0
dtype: float64

In [194]:
df1['Age'].mode()

0    49
dtype: int64

In [195]:
df1['Salary'].apply(np.sqrt)

Employee_ID
101    308.220700
102    291.547595
103    273.861279
104    254.950976
105    300.000000
106    282.842712
107    264.575131
108    244.948974
109    316.227766
110    212.132034
111    234.520788
112    254.950976
115           NaN
116           NaN
Name: Salary, dtype: float64

In [196]:
df1['Salary'].apply(lambda num : 1.1 * num)

Employee_ID
101    104500.0
102     93500.0
103     82500.0
104     71500.0
105     99000.0
106     88000.0
107     77000.0
108     66000.0
109    110000.0
110     49500.0
111     60500.0
112     71500.0
115         NaN
116         NaN
Name: Salary, dtype: float64

In [198]:
df1.Name.apply(lambda name : name.split()[0])

Employee_ID
101      Utkarsh
102       Kartik
103    Aishwarya
104        Anand
105      Shalini
106       Pratik
107     Monalika
108       Ayesha
109        Anant
110    Shamiksha
111     Prashant
112       Mohini
115       Kavita
116       Pratik
Name: Name, dtype: object

In [199]:
df1.Age.quantile(0.25)

29.25

In [200]:
df1.Age.quantile(0.5)

35.0

In [201]:
df1.Age.quantile(0.75)

46.25

In [207]:
df1.groupby(by = 'Gender')['Age'].mean()

Gender
Female    33.666667
Male      41.166667
Name: Age, dtype: float64

In [208]:
df1.groupby(by = 'Gender')['Salary'].mean()

Gender
Female    67500.0
Male      80000.0
Name: Salary, dtype: float64

In [209]:
df1.corr()

              ID    Salary       Age
ID      1.000000 -0.551406 -0.624005
Salary -0.551406  1.000000  0.697623
Age    -0.624005  0.697623  1.000000

# -------------------------------------------------------------------------------------
## Dealing With CSV Files

In [210]:
data = pd.read_csv('Automobile_Data.csv')
data.head(10)

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450
5,2,?,audi,gas,std,two,sedan,fwd,front,99.8,...,136,mpfi,3.19,3.4,8.5,110,5500,19,25,15250
6,1,158,audi,gas,std,four,sedan,fwd,front,105.8,...,136,mpfi,3.19,3.4,8.5,110,5500,19,25,17710
7,1,?,audi,gas,std,four,wagon,fwd,front,105.8,...,136,mpfi,3.19,3.4,8.5,110,5500,19,25,18920
8,1,158,audi,gas,turbo,four,sedan,fwd,front,105.8,...,131,mpfi,3.13,3.4,8.3,140,5500,17,20,23875
9,0,?,audi,gas,turbo,two,hatchback,4wd,front,99.5,...,131,mpfi,3.13,3.4,7.0,160,5500,16,22,?

In [211]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 26 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   symboling          205 non-null    int64
 1   normalized-losses  205 non-null    object
 2   make               205 non-null    object
 3   fuel-type          205 non-null    object
 4   aspiration         205 non-null    object
 5   num-of-doors       205 non-null    object
 6   body-style         205 non-null    object
 7   drive-wheels       205 non-null    object
 8   engine-location    205 non-null    object
 9   wheel-base         205 non-null    float64
 10  length             205 non-null    float64
 11  width              205 non-null    float64
 12  height             205 non-null    float64
 13  curb-weight        205 non-null    int64
 14  engine-type        205 non-null    object
 15  num-of-cylinders   205 non-null    object
 16  engine-size        205 non-null    int64
 17  fuel-system        205 non-null    object
 18  bore               205 non-null    object
 19  stroke             205 non-null    object
 20  compression-ratio  205 non-null    float64
 21  horsepower         205 non-null    object
 22  peak-rpm           205 non-null    object
 23  city-mpg           205 non-null    int64
 24  highway-mpg        205 non-null    int64
 25  price              205 non-null    object
dtypes: float64(5), int64(5), object(16)
memory usage: 41.8+ KB

In [212]:
data.columns

Index(['symboling', 'normalized-losses', 'make', 'fuel-type', 'aspiration',
       'num-of-doors', 'body-style', 'drive-wheels', 'engine-location',
       'wheel-base', 'length', 'width', 'height', 'curb-weight', 'engine-type',
       'num-of-cylinders', 'engine-size', 'fuel-system', 'bore', 'stroke',
       'compression-ratio', 'horsepower', 'peak-rpm', 'city-mpg',
       'highway-mpg', 'price'],
      dtype='object')

In [213]:
data.duplicated().sum()

0

In [217]:
data.replace('?', np.nan, inplace =True)

In [218]:
data.isnull().sum()

symboling             0
normalized-losses    41
make                  0
fuel-type             0
aspiration            0
num-of-doors          2
body-style            0
drive-wheels          0
engine-location       0
wheel-base            0
length                0
width                 0
height                0
curb-weight           0
engine-type           0
num-of-cylinders      0
engine-size           0
fuel-system           0
bore                  4
stroke                4
compression-ratio     0
horsepower            2
peak-rpm              2
city-mpg              0
highway-mpg           0
price                 4
dtype: int64

In [219]:
data.nunique()

symboling              6
normalized-losses     51
make                  22
fuel-type              2
aspiration             2
num-of-doors           2
body-style             5
drive-wheels           3
engine-location        2
wheel-base            53
length                75
width                 44
height                49
curb-weight          171
engine-type            7
num-of-cylinders       7
engine-size           44
fuel-system            8
bore                  38
stroke                36
compression-ratio     32
horsepower            59
peak-rpm              23
city-mpg              29
highway-mpg           30
price                186
dtype: int64

In [220]:
print('Fuel Types   : ',data['fuel-type'].unique())
print('Body Styles  : ',data['body-style'].unique())
print('Drive Wheels : ',data['drive-wheels'].unique())
print('Fuel System  : ',data['fuel-system'].unique())
print('Engine Type  : ',data['engine-type'].unique())

Fuel Types   :  ['gas' 'diesel']
Body Styles  :  ['convertible' 'hatchback' 'sedan' 'wagon' 'hardtop']
Drive Wheels :  ['rwd' 'fwd' '4wd']
Fuel System  :  ['mpfi' '2bbl' 'mfi' '1bbl' 'spfi' '4bbl' 'idi' 'spdi']
Engine Type  :  ['dohc' 'ohcv' 'ohc' 'l' 'rotor' 'ohcf' 'dohcv']

In [224]:
data['city-mpg'].mean()

25.21951219512195

In [225]:
data.groupby(by = 'fuel-type')['city-mpg'].mean()

fuel-type
diesel    30.30000
gas       24.67027
Name: city-mpg, dtype: float64

In [226]:
data['body-style'].value_counts()

sedan          96
hatchback      70
wagon          25
hardtop         8
convertible     6
Name: body-style, dtype: int64

In [228]:
data.groupby(by = 'body-style')['highway-mpg'].mean()

body-style
convertible    26.000000
hardtop        27.250000
hatchback      32.171429
sedan          30.833333
wagon          28.720000
Name: highway-mpg, dtype: float64

In [231]:
data.groupby(by = 'engine-size')['highway-mpg'].mean().sort_index(ascending = False)

engine-size
326    17.000000
308    16.000000
304    16.000000
258    19.000000
234    18.000000
209    21.333333
203    28.000000
194    25.000000
183    25.000000
181    23.666667
173    23.000000
171    24.000000
164    27.000000
161    24.000000
156    24.000000
152    29.166667
151    27.000000
146    30.000000
145    27.000000
141    27.142857
140    25.500000
136    24.200000
134    31.500000
132    31.000000
131    21.000000
130    24.500000
122    32.533333
121    27.333333
120    26.857143
119    29.000000
111    29.000000
110    33.083333
109    31.625000
108    30.076923
103    50.000000
98     33.785714
97     38.642857
92     37.400000
91     36.600000
90     40.166667
80     23.000000
79     42.000000
70     23.000000
61     53.000000
Name: highway-mpg, dtype: float64

In [232]:
data.groupby(by = ['body-style','fuel-type'])['city-mpg'].mean()

body-style   fuel-type
convertible  gas          20.500000
hardtop      diesel       22.000000
             gas          21.571429
hatchback    diesel       38.000000
             gas          26.144928
sedan        diesel       31.600000
             gas          24.160494
wagon        diesel       24.000000
             gas          24.045455
Name: city-mpg, dtype: float64